<a href="https://colab.research.google.com/github/KamyshOk/Pr_IS_01/blob/main/PR_IS1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
import numpy as np
from IPython.display import display

In [8]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [9]:
names = ["ID","RI","Na","Mg","Al","Si","K","Ca","Ba","Fe", "Class"]
data.columns = names
data = data.drop(columns=['ID'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [10]:
data['Class'].replace({1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [14]:
for col in data.columns:
   fr = np.random.randint(5,100)/100
   data.loc[data.sample(frac=fr).index, col] = np.nan
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      14 non-null     float64
 1   Na      1 non-null      float64
 2   Mg      55 non-null     float64
 3   Al      2 non-null      float64
 4   Si      10 non-null     float64
 5   K       5 non-null      float64
 6   Ca      29 non-null     float64
 7   Ba      46 non-null     float64
 8   Fe      64 non-null     float64
 9   Class   3 non-null      object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      14 non-null     float64
 1   Na      1 non-null      float64
 2   Mg      55 non-null     float64
 3   Al      2 non-null      float64
 4   Si      10 non-null     float64
 5   K       5 non-null      float64
 6   Ca      29 non-null     float64
 7   Ba      46 non-null     float64
 8   Fe      64 non-null     float64
 9   Class   3 non-null      object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [16]:
data.describe()

              RI     Na         Mg  ...         Ca         Ba         Fe
count  14.000000   1.00  55.000000  ...  29.000000  46.000000  64.000000
mean    1.518816  13.44   2.866364  ...   8.693793   0.175000   0.056563
std     0.003277    NaN   1.374416  ...   1.005497   0.381283   0.107145
min     1.515880  13.44   0.000000  ...   6.470000   0.000000   0.000000
25%     1.517115  13.44   3.135000  ...   8.150000   0.000000   0.000000
50%     1.517505  13.44   3.520000  ...   8.490000   0.000000   0.000000
75%     1.518477  13.44   3.625000  ...   8.930000   0.097500   0.092500
max     1.527390  13.44   3.970000  ...  11.640000   1.590000   0.510000

[8 rows x 9 columns]

In [17]:
display(data["Class"].describe())
display(print("========================="))
display(data['Class'].value_counts())

count             3
unique            2
top       headlamps
freq              2
Name: Class, dtype: object

=========================

None

headlamps             2
building_non_float    1
Name: Class, dtype: int64